name: "BCN_RES50"
layer {
  name: "data_raw"
  type: "MultiLabelData"
  top: "data_raw"
  top: "label"
  embed_param {
    num_output: 2
  }
  data_param {
    source: "Data/yovo3m_cls_train_targets.bin"
    prefetch: 10
  }
  aug_data_param {
    source: "Data/yovo3m_cls_train_list.txt"
	batch_size: 8
    shuffle: true
    new_length: 32
    num_segments: 1
	prefix: "LMDB"
    stream: CLIP
	autoskip: true
	multithread: true
  }
  aug_tranform_param {
    mirror: true
    crop_size: 112
    mean_value: [104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123,
	104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123,
	104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123,
	104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123,
    104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123,
	104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123,
	104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123,
	104, 117, 123, 104, 117, 123, 104, 117, 123, 104, 117, 123]
    multi_scale: true
    scale_ratios: [1, 0.875, 0.75, 0.66]
    max_distort: 1

    contrast_brightness_adjustment: true
    min_contrast: 0.8
    max_contrast: 1.2
    smooth_filtering: true
    max_smooth: 3
    apply_probability: 0.5
    max_color_shift: 20
  }
  include {
    phase: TRAIN
  }
}


layer {
  name: "data_reshape"
  type: "Reshape"
  bottom: "data_raw"
  top: "data_reshape"
  reshape_param {
    shape {
	  dim: -1
	  dim: 3
	  dim: 0
	  dim: 0
	}
  }
}

layer {
  name: "data"
  type: "VideoSwitch"
  bottom: "data_reshape"
  top: "data"
  video_switch_param {
    switch: VIDEO
	frame_num: 32
  }
}

layer {
  name: "label_split"
  type: "Slice"
  bottom: "label"
  top: "query_label"
  top: "text_label"
  slice_param{
    axis: 1
	slice_point: 2015
  }
}

#----------------------------res50 layers------------------------------
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    pad: 3
    pad: 3
    kernel_size: 4
    kernel_size: 7
    kernel_size: 7
    stride: 4
    stride: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv1/bn"
  type: "BNLight"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "conv1/bn/relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "global_mem"
  type: "Pooling3D"
  bottom: "conv1"
  top: "global_mem"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres2a_gap"
  type: "Pooling3D"
  bottom: "conv1"
  top: "resres2a_gap"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres2a_hfc1"
  type: "InnerProduct"
  bottom: "resres2a_gap"
  top: "resres2a_hfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2a_hfc2"
  type: "InnerProduct"
  bottom: "resres2a_hfc1"
  top: "resres2a_hfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 64
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2a_cfc1"
  type: "InnerProduct"
  bottom: "global_mem"
  top: "resres2a_cfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2a_cfc2"
  type: "InnerProduct"
  bottom: "resres2a_cfc1"
  top: "resres2a_cfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 64
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "conv1"
  top: "res2a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2a_branch1/bn"
  type: "BNLight"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "conv1"
  top: "res2a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2a_branch2a/bn"
  type: "BNLight"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res2a_branch2a/bn/relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2a_branch2b/bn"
  type: "BNLight"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res2a_branch2b/bn/relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
}
layer {
  name: "res2a_branch2b_t"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b_t"
  top: "res2a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2a_branch2c/bn"
  type: "BNLight"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "resres2a_g"
  type: "Eltwise"
  bottom: "resres2a_hfc2"
  bottom: "resres2a_cfc2"
  top: "resres2a_g"
}
layer {
  name: "resres2a_g_relu"
  type: "ReLU"
  bottom: "resres2a_g"
  top: "resres2a_g"
}
layer {
  name: "res2a_down"
  type: "InnerProduct"
  bottom: "resres2a_g"
  top: "res2a_down"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2a_up"
  type: "InnerProduct"
  bottom: "res2a_down"
  top: "res2a_up"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2a"
  type: "Apxpy"
  bottom: "res2a_up"
  bottom: "res2a_branch2c"
  bottom: "res2a_branch1"
  top: "res2a"
}
layer {
  name: "res2a/relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "resres2b_gap"
  type: "Pooling3D"
  bottom: "res2a"
  top: "resres2b_gap"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres2b_hfc1"
  type: "InnerProduct"
  bottom: "resres2b_gap"
  top: "resres2b_hfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2b_hfc2"
  type: "InnerProduct"
  bottom: "resres2b_hfc1"
  top: "resres2b_hfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2b_cfc1"
  type: "InnerProduct"
  bottom: "resres2a_g"
  top: "resres2b_cfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2b_cfc2"
  type: "InnerProduct"
  bottom: "resres2b_cfc1"
  top: "resres2b_cfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2b_branch2a/bn"
  type: "BNLight"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res2b_branch2a/bn/relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2b_branch2b/bn"
  type: "BNLight"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res2b_branch2b/bn/relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
}
layer {
  name: "res2b_branch2b_t"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b_t"
  top: "res2b_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2b_branch2c/bn"
  type: "BNLight"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "resres2b_g"
  type: "Eltwise"
  bottom: "resres2b_hfc2"
  bottom: "resres2b_cfc2"
  top: "resres2b_g"
}
layer {
  name: "resres2b_g_relu"
  type: "ReLU"
  bottom: "resres2b_g"
  top: "resres2b_g"
}
layer {
  name: "res2b_down"
  type: "InnerProduct"
  bottom: "resres2b_g"
  top: "res2b_down"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2b_up"
  type: "InnerProduct"
  bottom: "res2b_down"
  top: "res2b_up"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2b"
  type: "Apxpy"
  bottom: "res2b_up"
  bottom: "res2b_branch2c"
  bottom: "res2a"
  top: "res2b"
}
layer {
  name: "res2b/relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
}
layer {
  name: "resres2c_gap"
  type: "Pooling3D"
  bottom: "res2b"
  top: "resres2c_gap"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres2c_hfc1"
  type: "InnerProduct"
  bottom: "resres2c_gap"
  top: "resres2c_hfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2c_hfc2"
  type: "InnerProduct"
  bottom: "resres2c_hfc1"
  top: "resres2c_hfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2c_cfc1"
  type: "InnerProduct"
  bottom: "resres2b_g"
  top: "resres2c_cfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres2c_cfc2"
  type: "InnerProduct"
  bottom: "resres2c_cfc1"
  top: "resres2c_cfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2c_branch2a/bn"
  type: "BNLight"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res2c_branch2a/bn/relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2c_branch2b/bn"
  type: "BNLight"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res2c_branch2b/bn/relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
}
layer {
  name: "res2c_branch2b_t"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b_t"
  top: "res2c_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res2c_branch2c/bn"
  type: "BNLight"
  bottom: "res2c_branch2c"
  top: "res2c_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "resres2c_g"
  type: "Eltwise"
  bottom: "resres2c_hfc2"
  bottom: "resres2c_cfc2"
  top: "resres2c_g"
}
layer {
  name: "resres2c_g_relu"
  type: "ReLU"
  bottom: "resres2c_g"
  top: "resres2c_g"
}
layer {
  name: "res2c_down"
  type: "InnerProduct"
  bottom: "resres2c_g"
  top: "res2c_down"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2c_up"
  type: "InnerProduct"
  bottom: "res2c_down"
  top: "res2c_up"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2c"
  type: "Apxpy"
  bottom: "res2c_up"
  bottom: "res2c_branch2c"
  bottom: "res2b"
  top: "res2c"
}
layer {
  name: "res2c/relu"
  type: "ReLU"
  bottom: "res2c"
  top: "res2c"
}
layer {
  name: "resres3a_gap"
  type: "Pooling3D"
  bottom: "res2c"
  top: "resres3a_gap"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres3a_hfc1"
  type: "InnerProduct"
  bottom: "resres3a_gap"
  top: "resres3a_hfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3a_hfc2"
  type: "InnerProduct"
  bottom: "resres3a_hfc1"
  top: "resres3a_hfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3a_cfc1"
  type: "InnerProduct"
  bottom: "resres2c_g"
  top: "resres3a_cfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3a_cfc2"
  type: "InnerProduct"
  bottom: "resres3a_cfc1"
  top: "resres3a_cfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3a_branch1"
  type: "Convolution"
  bottom: "res2c"
  top: "res3a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3a_branch1/bn"
  type: "BNLight"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3a_branch2a"
  type: "Convolution"
  bottom: "res2c"
  top: "res3a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3a_branch2a/bn"
  type: "BNLight"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3a_branch2a/bn/relu"
  type: "ReLU"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
}
layer {
  name: "res3a_branch2b"
  type: "Convolution"
  bottom: "res3a_branch2a"
  top: "res3a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3a_branch2b/bn"
  type: "BNLight"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3a_branch2b/bn/relu"
  type: "ReLU"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
}
layer {
  name: "res3a_branch2b_t"
  type: "Convolution"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3a_branch2c"
  type: "Convolution"
  bottom: "res3a_branch2b_t"
  top: "res3a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3a_branch2c/bn"
  type: "BNLight"
  bottom: "res3a_branch2c"
  top: "res3a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "resres3a_g"
  type: "Eltwise"
  bottom: "resres3a_hfc2"
  bottom: "resres3a_cfc2"
  top: "resres3a_g"
}
layer {
  name: "resres3a_g_relu"
  type: "ReLU"
  bottom: "resres3a_g"
  top: "resres3a_g"
}
layer {
  name: "res3a_down"
  type: "InnerProduct"
  bottom: "resres3a_g"
  top: "res3a_down"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3a_up"
  type: "InnerProduct"
  bottom: "res3a_down"
  top: "res3a_up"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3a"
  type: "Apxpy"
  bottom: "res3a_up"
  bottom: "res3a_branch2c"
  bottom: "res3a_branch1"
  top: "res3a"
}
layer {
  name: "res3a/relu"
  type: "ReLU"
  bottom: "res3a"
  top: "res3a"
}
layer {
  name: "resres3b_gap"
  type: "Pooling3D"
  bottom: "res3a"
  top: "resres3b_gap"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres3b_hfc1"
  type: "InnerProduct"
  bottom: "resres3b_gap"
  top: "resres3b_hfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3b_hfc2"
  type: "InnerProduct"
  bottom: "resres3b_hfc1"
  top: "resres3b_hfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3b_cfc1"
  type: "InnerProduct"
  bottom: "resres3a_g"
  top: "resres3b_cfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3b_cfc2"
  type: "InnerProduct"
  bottom: "resres3b_cfc1"
  top: "resres3b_cfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3b_branch2a"
  type: "Convolution"
  bottom: "res3a"
  top: "res3b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3b_branch2a/bn"
  type: "BNLight"
  bottom: "res3b_branch2a"
  top: "res3b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3b_branch2a/bn/relu"
  type: "ReLU"
  bottom: "res3b_branch2a"
  top: "res3b_branch2a"
}
layer {
  name: "res3b_branch2b"
  type: "Convolution"
  bottom: "res3b_branch2a"
  top: "res3b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3b_branch2b/bn"
  type: "BNLight"
  bottom: "res3b_branch2b"
  top: "res3b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3b_branch2b/bn/relu"
  type: "ReLU"
  bottom: "res3b_branch2b"
  top: "res3b_branch2b"
}
layer {
  name: "res3b_branch2b_t"
  type: "Convolution"
  bottom: "res3b_branch2b"
  top: "res3b_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3b_branch2c"
  type: "Convolution"
  bottom: "res3b_branch2b_t"
  top: "res3b_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3b_branch2c/bn"
  type: "BNLight"
  bottom: "res3b_branch2c"
  top: "res3b_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "resres3b_g"
  type: "Eltwise"
  bottom: "resres3b_hfc2"
  bottom: "resres3b_cfc2"
  top: "resres3b_g"
}
layer {
  name: "resres3b_g_relu"
  type: "ReLU"
  bottom: "resres3b_g"
  top: "resres3b_g"
}
layer {
  name: "res3b_down"
  type: "InnerProduct"
  bottom: "resres3b_g"
  top: "res3b_down"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3b_up"
  type: "InnerProduct"
  bottom: "res3b_down"
  top: "res3b_up"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3b"
  type: "Apxpy"
  bottom: "res3b_up"
  bottom: "res3b_branch2c"
  bottom: "res3a"
  top: "res3b"
}
layer {
  name: "res3b/relu"
  type: "ReLU"
  bottom: "res3b"
  top: "res3b"
}
layer {
  name: "resres3c_gap"
  type: "Pooling3D"
  bottom: "res3b"
  top: "resres3c_gap"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres3c_hfc1"
  type: "InnerProduct"
  bottom: "resres3c_gap"
  top: "resres3c_hfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3c_hfc2"
  type: "InnerProduct"
  bottom: "resres3c_hfc1"
  top: "resres3c_hfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3c_cfc1"
  type: "InnerProduct"
  bottom: "resres3b_g"
  top: "resres3c_cfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3c_cfc2"
  type: "InnerProduct"
  bottom: "resres3c_cfc1"
  top: "resres3c_cfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3c_branch2a"
  type: "Convolution"
  bottom: "res3b"
  top: "res3c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3c_branch2a/bn"
  type: "BNLight"
  bottom: "res3c_branch2a"
  top: "res3c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3c_branch2a/bn/relu"
  type: "ReLU"
  bottom: "res3c_branch2a"
  top: "res3c_branch2a"
}
layer {
  name: "res3c_branch2b"
  type: "Convolution"
  bottom: "res3c_branch2a"
  top: "res3c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3c_branch2b/bn"
  type: "BNLight"
  bottom: "res3c_branch2b"
  top: "res3c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3c_branch2b/bn/relu"
  type: "ReLU"
  bottom: "res3c_branch2b"
  top: "res3c_branch2b"
}
layer {
  name: "res3c_branch2b_t"
  type: "Convolution"
  bottom: "res3c_branch2b"
  top: "res3c_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3c_branch2c"
  type: "Convolution"
  bottom: "res3c_branch2b_t"
  top: "res3c_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3c_branch2c/bn"
  type: "BNLight"
  bottom: "res3c_branch2c"
  top: "res3c_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "resres3c_g"
  type: "Eltwise"
  bottom: "resres3c_hfc2"
  bottom: "resres3c_cfc2"
  top: "resres3c_g"
}
layer {
  name: "resres3c_g_relu"
  type: "ReLU"
  bottom: "resres3c_g"
  top: "resres3c_g"
}
layer {
  name: "res3c_down"
  type: "InnerProduct"
  bottom: "resres3c_g"
  top: "res3c_down"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3c_up"
  type: "InnerProduct"
  bottom: "res3c_down"
  top: "res3c_up"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3c"
  type: "Apxpy"
  bottom: "res3c_up"
  bottom: "res3c_branch2c"
  bottom: "res3b"
  top: "res3c"
}
layer {
  name: "res3c/relu"
  type: "ReLU"
  bottom: "res3c"
  top: "res3c"
}
layer {
  name: "resres3d_gap"
  type: "Pooling3D"
  bottom: "res3c"
  top: "resres3d_gap"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres3d_hfc1"
  type: "InnerProduct"
  bottom: "resres3d_gap"
  top: "resres3d_hfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3d_hfc2"
  type: "InnerProduct"
  bottom: "resres3d_hfc1"
  top: "resres3d_hfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3d_cfc1"
  type: "InnerProduct"
  bottom: "resres3c_g"
  top: "resres3d_cfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres3d_cfc2"
  type: "InnerProduct"
  bottom: "resres3d_cfc1"
  top: "resres3d_cfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3d_branch2a"
  type: "Convolution"
  bottom: "res3c"
  top: "res3d_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3d_branch2a/bn"
  type: "BNLight"
  bottom: "res3d_branch2a"
  top: "res3d_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3d_branch2a/bn/relu"
  type: "ReLU"
  bottom: "res3d_branch2a"
  top: "res3d_branch2a"
}
layer {
  name: "res3d_branch2b"
  type: "Convolution"
  bottom: "res3d_branch2a"
  top: "res3d_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    pad: 1
    pad: 1
    kernel_size: 1
    kernel_size: 3
    kernel_size: 3
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3d_branch2b/bn"
  type: "BNLight"
  bottom: "res3d_branch2b"
  top: "res3d_branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res3d_branch2b/bn/relu"
  type: "ReLU"
  bottom: "res3d_branch2b"
  top: "res3d_branch2b"
}
layer {
  name: "res3d_branch2b_t"
  type: "Convolution"
  bottom: "res3d_branch2b"
  top: "res3d_branch2b_t"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    pad: 0
    pad: 0
    kernel_size: 3
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3d_branch2c"
  type: "Convolution"
  bottom: "res3d_branch2b_t"
  top: "res3d_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res3d_branch2c/bn"
  type: "BNLight"
  bottom: "res3d_branch2c"
  top: "res3d_branch2c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "resres3d_g"
  type: "Eltwise"
  bottom: "resres3d_hfc2"
  bottom: "resres3d_cfc2"
  top: "resres3d_g"
}
layer {
  name: "resres3d_g_relu"
  type: "ReLU"
  bottom: "resres3d_g"
  top: "resres3d_g"
}
layer {
  name: "res3d_down"
  type: "InnerProduct"
  bottom: "resres3d_g"
  top: "res3d_down"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3d_up"
  type: "InnerProduct"
  bottom: "res3d_down"
  top: "res3d_up"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3d"
  type: "Apxpy"
  bottom: "res3d_up"
  bottom: "res3d_branch2c"
  bottom: "res3c"
  top: "res3d"
}
layer {
  name: "res3d/relu"
  type: "ReLU"
  bottom: "res3d"
  top: "res3d"
}
layer {
  name: "resres4a_gap"
  type: "Pooling3D"
  bottom: "res3d"
  top: "resres4a_gap"
  pooling3d_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "resres4a_hfc1"
  type: "InnerProduct"
  bottom: "resres4a_gap"
  top: "resres4a_hfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres4a_hfc2"
  type: "InnerProduct"
  bottom: "resres4a_hfc1"
  top: "resres4a_hfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres4a_cfc1"
  type: "InnerProduct"
  bottom: "resres3d_g"
  top: "resres4a_cfc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 32
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "resres4a_cfc2"
  type: "InnerProduct"
  bottom: "resres4a_cfc1"
  top: "resres4a_cfc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res4a_branch1"
  type: "Convolution"
  bottom: "res3d"
  top: "res4a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res4a_branch1/bn"
  type: "BNLight"
  bottom: "res4a_branch1"
  top: "res4a_branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res4a_branch2a"
  type: "Convolution"
  bottom: "res3d"
  top: "res4a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    pad: 0
    pad: 0
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 2
    stride: 2
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "res4a_branch2a/bn"
  type: "BNLight"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  bn_param {
    slope_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    momentum: 0.95
    frozen: false
    gpusync: false
  }
}
layer {
  name: "res4a_branch2a/bn/relu"
  type: "ReLU"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
}
layer {
  name: "res4a_branch2b"
